Revit 2024 API
OpenOptions.AllowOpeningLocalByWrongUser Property
 Specifies whether a local file is allowed to be opened as read-only by a user other than its owner.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool AllowOpeningLocalByWrongUser { get; set; }
Visual Basic
Public Property AllowOpeningLocalByWrongUser As Boolean
	Get
	Set
Visual C++
public:
property bool AllowOpeningLocalByWrongUser {
	bool get ();
	void set (bool value);
}
Remarks
 The default is false. This option is ignored for central and non-workshared models.
See Also
OpenOptions Class
Autodesk.Revit.DB Namespace